Revit 2027 API
IFCAggregate.GetIFCAggregateIterator Method
 Returns a IFCAggregateIterator that iterates through the collection.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IFCAggregateIterator GetIFCAggregateIterator()
Public Function GetIFCAggregateIterator As IFCAggregateIterator
public:
IFCAggregateIterator^ GetIFCAggregateIterator()
member GetIFCAggregateIterator : unit -> IFCAggregateIterator
Return Value
IFCAggregateIterator
See Also
Reference
IFCAggregate Class
Autodesk.Revit.DB.IFC Namespace